results/yugabyte-kubernetes-3-node-cluster.txt
====== PING_INLINE ======
  100000 requests completed in 7.69 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.07% <= 1 milliseconds
6.10% <= 2 milliseconds
37.27% <= 3 milliseconds
79.85% <= 4 milliseconds
93.28% <= 5 milliseconds
96.06% <= 6 milliseconds
97.57% <= 7 milliseconds
98.48% <= 8 milliseconds
99.18% <= 9 milliseconds
99.51% <= 10 milliseconds
99.69% <= 11 milliseconds
99.79% <= 12 milliseconds
99.85% <= 13 milliseconds
99.89% <= 14 milliseconds
99.92% <= 15 milliseconds
99.95% <= 16 milliseconds
99.95% <= 17 milliseconds
99.96% <= 18 milliseconds
99.97% <= 19 milliseconds
99.99% <= 20 milliseconds
100.00% <= 20 milliseconds
12,997.14 requests per second

====== PING_BULK ======
  100000 requests completed in 7.85 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.06% <= 1 milliseconds
5.64% <= 2 milliseconds
35.91% <= 3 milliseconds
77.90% <= 4 milliseconds
92.49% <= 5 milliseconds
95.80% <= 6 milliseconds
97.45% <= 7 milliseconds
98.39% <= 8 milliseconds
99.05% <= 9 milliseconds
99.32% <= 10 milliseconds
99.53% <= 11 milliseconds
99.61% <= 12 milliseconds
99.70% <= 13 milliseconds
99.80% <= 14 milliseconds
99.84% <= 15 milliseconds
99.87% <= 16 milliseconds
99.89% <= 17 milliseconds
99.93% <= 18 milliseconds
99.97% <= 19 milliseconds
99.98% <= 20 milliseconds
99.98% <= 21 milliseconds
99.98% <= 25 milliseconds
99.99% <= 26 milliseconds
100.00% <= 27 milliseconds
100.00% <= 27 milliseconds
12,738.85 requests per second

====== SET ======
  100000 requests completed in 116.04 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
0.00% <= 2 milliseconds
0.05% <= 3 milliseconds
0.14% <= 4 milliseconds
0.30% <= 5 milliseconds
0.43% <= 6 milliseconds
0.50% <= 7 milliseconds
0.55% <= 8 milliseconds
0.57% <= 9 milliseconds
0.59% <= 10 milliseconds
0.60% <= 11 milliseconds
0.62% <= 12 milliseconds
0.62% <= 13 milliseconds
0.63% <= 14 milliseconds
0.63% <= 15 milliseconds
0.64% <= 16 milliseconds
0.64% <= 17 milliseconds
0.64% <= 18 milliseconds
0.65% <= 19 milliseconds
0.65% <= 20 milliseconds
0.65% <= 21 milliseconds
0.65% <= 22 milliseconds
0.66% <= 23 milliseconds
0.66% <= 24 milliseconds
0.67% <= 25 milliseconds
0.67% <= 26 milliseconds
0.67% <= 27 milliseconds
0.68% <= 28 milliseconds
0.68% <= 29 milliseconds
0.69% <= 30 milliseconds
0.69% <= 31 milliseconds
0.70% <= 32 milliseconds
0.70% <= 33 milliseconds
0.71% <= 34 milliseconds
0.72% <= 35 milliseconds
0.72% <= 36 milliseconds
0.73% <= 37 milliseconds
0.73% <= 38 milliseconds
0.74% <= 39 milliseconds
0.75% <= 40 milliseconds
0.75% <= 41 milliseconds
0.76% <= 42 milliseconds
0.76% <= 43 milliseconds
0.78% <= 44 milliseconds
0.87% <= 45 milliseconds
1.16% <= 46 milliseconds
2.18% <= 47 milliseconds
4.83% <= 48 milliseconds
9.88% <= 49 milliseconds
16.75% <= 50 milliseconds
24.51% <= 51 milliseconds
31.22% <= 52 milliseconds
37.87% <= 53 milliseconds
44.18% <= 54 milliseconds
49.84% <= 55 milliseconds
55.29% <= 56 milliseconds
59.74% <= 57 milliseconds
63.85% <= 58 milliseconds
67.39% <= 59 milliseconds
70.41% <= 60 milliseconds
73.07% <= 61 milliseconds
75.38% <= 62 milliseconds
77.60% <= 63 milliseconds
79.59% <= 64 milliseconds
81.40% <= 65 milliseconds
82.81% <= 66 milliseconds
84.36% <= 67 milliseconds
85.80% <= 68 milliseconds
87.18% <= 69 milliseconds
88.46% <= 70 milliseconds
89.58% <= 71 milliseconds
90.59% <= 72 milliseconds
91.49% <= 73 milliseconds
92.20% <= 74 milliseconds
92.92% <= 75 milliseconds
93.63% <= 76 milliseconds
94.17% <= 77 milliseconds
94.56% <= 78 milliseconds
94.97% <= 79 milliseconds
95.40% <= 80 milliseconds
95.76% <= 81 milliseconds
96.08% <= 82 milliseconds
96.44% <= 83 milliseconds
96.75% <= 84 milliseconds
97.02% <= 85 milliseconds
97.24% <= 86 milliseconds
97.44% <= 87 milliseconds
97.59% <= 88 milliseconds
97.70% <= 89 milliseconds
97.84% <= 90 milliseconds
97.96% <= 91 milliseconds
98.06% <= 92 milliseconds
98.19% <= 93 milliseconds
98.31% <= 94 milliseconds
98.39% <= 95 milliseconds
98.49% <= 96 milliseconds
98.60% <= 97 milliseconds
98.68% <= 98 milliseconds
98.76% <= 99 milliseconds
98.82% <= 100 milliseconds
98.89% <= 101 milliseconds
98.96% <= 102 milliseconds
99.02% <= 103 milliseconds
99.07% <= 104 milliseconds
99.12% <= 105 milliseconds
99.17% <= 106 milliseconds
99.26% <= 107 milliseconds
99.33% <= 108 milliseconds
99.40% <= 109 milliseconds
99.46% <= 110 milliseconds
99.52% <= 111 milliseconds
99.57% <= 112 milliseconds
99.61% <= 113 milliseconds
99.65% <= 114 milliseconds
99.67% <= 115 milliseconds
99.70% <= 116 milliseconds
99.74% <= 117 milliseconds
99.75% <= 118 milliseconds
99.77% <= 119 milliseconds
99.78% <= 120 milliseconds
99.80% <= 121 milliseconds
99.81% <= 122 milliseconds
99.82% <= 123 milliseconds
99.83% <= 124 milliseconds
99.86% <= 125 milliseconds
99.87% <= 126 milliseconds
99.88% <= 127 milliseconds
99.90% <= 128 milliseconds
99.92% <= 129 milliseconds
99.93% <= 130 milliseconds
99.93% <= 131 milliseconds
99.93% <= 132 milliseconds
99.95% <= 133 milliseconds
99.96% <= 134 milliseconds
99.96% <= 135 milliseconds
99.96% <= 136 milliseconds
99.97% <= 137 milliseconds
99.98% <= 138 milliseconds
99.98% <= 139 milliseconds
99.99% <= 140 milliseconds
100.00% <= 141 milliseconds
100.00% <= 142 milliseconds
100.00% <= 143 milliseconds
100.00% <= 144 milliseconds
100.00% <= 145 milliseconds
100.00% <= 147 milliseconds
861.79 requests per second

====== GET ======
  100000 requests completed in 14.35 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
0.07% <= 2 milliseconds
0.30% <= 3 milliseconds
1.03% <= 4 milliseconds
8.17% <= 5 milliseconds
32.43% <= 6 milliseconds
70.32% <= 7 milliseconds
87.64% <= 8 milliseconds
93.29% <= 9 milliseconds
95.29% <= 10 milliseconds
96.63% <= 11 milliseconds
97.58% <= 12 milliseconds
98.13% <= 13 milliseconds
98.50% <= 14 milliseconds
98.83% <= 15 milliseconds
99.12% <= 16 milliseconds
99.33% <= 17 milliseconds
99.50% <= 18 milliseconds
99.59% <= 19 milliseconds
99.62% <= 20 milliseconds
99.67% <= 21 milliseconds
99.73% <= 22 milliseconds
99.82% <= 23 milliseconds
99.88% <= 24 milliseconds
99.93% <= 25 milliseconds
99.95% <= 26 milliseconds
99.95% <= 28 milliseconds
99.95% <= 29 milliseconds
99.95% <= 31 milliseconds
99.96% <= 32 milliseconds
99.99% <= 33 milliseconds
99.99% <= 34 milliseconds
99.99% <= 64 milliseconds
100.00% <= 64 milliseconds
6967.67 requests per second

====== INCR ======
  100000 requests completed in 120.79 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
0.00% <= 2 milliseconds
0.00% <= 3 milliseconds
0.01% <= 4 milliseconds
0.01% <= 7 milliseconds
0.01% <= 13 milliseconds
0.01% <= 14 milliseconds
0.01% <= 16 milliseconds
0.02% <= 17 milliseconds
0.02% <= 18 milliseconds
0.02% <= 19 milliseconds
0.02% <= 21 milliseconds
0.02% <= 22 milliseconds
0.02% <= 24 milliseconds
0.02% <= 25 milliseconds
0.03% <= 28 milliseconds
0.03% <= 29 milliseconds
0.03% <= 30 milliseconds
0.03% <= 31 milliseconds
0.03% <= 32 milliseconds
0.04% <= 34 milliseconds
0.04% <= 35 milliseconds
0.04% <= 36 milliseconds
0.05% <= 37 milliseconds
0.05% <= 38 milliseconds
0.05% <= 39 milliseconds
0.06% <= 40 milliseconds
0.06% <= 41 milliseconds
0.07% <= 42 milliseconds
0.08% <= 43 milliseconds
0.09% <= 44 milliseconds
0.11% <= 45 milliseconds
0.14% <= 46 milliseconds
0.27% <= 47 milliseconds
0.74% <= 48 milliseconds
2.30% <= 49 milliseconds
5.43% <= 50 milliseconds
10.20% <= 51 milliseconds
15.46% <= 52 milliseconds
21.63% <= 53 milliseconds
27.94% <= 54 milliseconds
34.09% <= 55 milliseconds
40.50% <= 56 milliseconds
46.72% <= 57 milliseconds
52.37% <= 58 milliseconds
57.64% <= 59 milliseconds
62.37% <= 60 milliseconds
66.21% <= 61 milliseconds
69.74% <= 62 milliseconds
72.83% <= 63 milliseconds
75.57% <= 64 milliseconds
77.78% <= 65 milliseconds
79.76% <= 66 milliseconds
81.58% <= 67 milliseconds
83.28% <= 68 milliseconds
84.83% <= 69 milliseconds
86.19% <= 70 milliseconds
87.51% <= 71 milliseconds
88.79% <= 72 milliseconds
89.99% <= 73 milliseconds
91.06% <= 74 milliseconds
92.10% <= 75 milliseconds
93.00% <= 76 milliseconds
93.81% <= 77 milliseconds
94.44% <= 78 milliseconds
94.96% <= 79 milliseconds
95.39% <= 80 milliseconds
95.80% <= 81 milliseconds
96.18% <= 82 milliseconds
96.49% <= 83 milliseconds
96.72% <= 84 milliseconds
96.94% <= 85 milliseconds
97.20% <= 86 milliseconds
97.45% <= 87 milliseconds
97.66% <= 88 milliseconds
97.84% <= 89 milliseconds
98.00% <= 90 milliseconds
98.11% <= 91 milliseconds
98.22% <= 92 milliseconds
98.33% <= 93 milliseconds
98.42% <= 94 milliseconds
98.51% <= 95 milliseconds
98.57% <= 96 milliseconds
98.65% <= 97 milliseconds
98.72% <= 98 milliseconds
98.78% <= 99 milliseconds
98.84% <= 100 milliseconds
98.88% <= 101 milliseconds
98.91% <= 102 milliseconds
98.96% <= 103 milliseconds
99.01% <= 104 milliseconds
99.04% <= 105 milliseconds
99.07% <= 106 milliseconds
99.10% <= 107 milliseconds
99.13% <= 108 milliseconds
99.18% <= 109 milliseconds
99.23% <= 110 milliseconds
99.28% <= 111 milliseconds
99.31% <= 112 milliseconds
99.34% <= 113 milliseconds
99.38% <= 114 milliseconds
99.44% <= 115 milliseconds
99.47% <= 116 milliseconds
99.50% <= 117 milliseconds
99.53% <= 118 milliseconds
99.56% <= 119 milliseconds
99.58% <= 120 milliseconds
99.63% <= 121 milliseconds
99.67% <= 122 milliseconds
99.71% <= 123 milliseconds
99.74% <= 124 milliseconds
99.76% <= 125 milliseconds
99.78% <= 126 milliseconds
99.80% <= 127 milliseconds
99.82% <= 128 milliseconds
99.84% <= 129 milliseconds
99.86% <= 130 milliseconds
99.90% <= 131 milliseconds
99.93% <= 132 milliseconds
99.94% <= 133 milliseconds
99.95% <= 134 milliseconds
99.95% <= 135 milliseconds
99.96% <= 136 milliseconds
99.96% <= 137 milliseconds
99.96% <= 138 milliseconds
99.96% <= 139 milliseconds
99.97% <= 140 milliseconds
99.97% <= 141 milliseconds
99.98% <= 142 milliseconds
99.98% <= 143 milliseconds
99.98% <= 144 milliseconds
99.98% <= 145 milliseconds
99.99% <= 146 milliseconds
99.99% <= 147 milliseconds
100.00% <= 148 milliseconds
100.00% <= 149 milliseconds
827.87 requests per second

====== LPUSH ======
  100000 requests completed in 7.90 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.04% <= 1 milliseconds
4.49% <= 2 milliseconds
32.56% <= 3 milliseconds
75.14% <= 4 milliseconds
92.27% <= 5 milliseconds
96.17% <= 6 milliseconds
97.58% <= 7 milliseconds
98.66% <= 8 milliseconds
99.34% <= 9 milliseconds
99.71% <= 10 milliseconds
99.84% <= 11 milliseconds
99.89% <= 12 milliseconds
99.95% <= 13 milliseconds
99.98% <= 14 milliseconds
99.98% <= 15 milliseconds
100.00% <= 16 milliseconds
100.00% <= 16 milliseconds
12653.42 requests per second

====== RPUSH ======
  100000 requests completed in 7.97 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.04% <= 1 milliseconds
5.22% <= 2 milliseconds
33.42% <= 3 milliseconds
76.13% <= 4 milliseconds
91.68% <= 5 milliseconds
95.08% <= 6 milliseconds
96.62% <= 7 milliseconds
97.88% <= 8 milliseconds
98.68% <= 9 milliseconds
99.18% <= 10 milliseconds
99.42% <= 11 milliseconds
99.63% <= 12 milliseconds
99.77% <= 13 milliseconds
99.87% <= 14 milliseconds
99.93% <= 15 milliseconds
99.97% <= 16 milliseconds
99.98% <= 17 milliseconds
99.98% <= 18 milliseconds
99.99% <= 19 milliseconds
100.00% <= 20 milliseconds
100.00% <= 21 milliseconds
12548.63 requests per second

====== LPOP ======
  100000 requests completed in 8.11 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.05% <= 1 milliseconds
4.56% <= 2 milliseconds
31.96% <= 3 milliseconds
73.33% <= 4 milliseconds
90.55% <= 5 milliseconds
95.36% <= 6 milliseconds
97.28% <= 7 milliseconds
98.38% <= 8 milliseconds
98.98% <= 9 milliseconds
99.39% <= 10 milliseconds
99.65% <= 11 milliseconds
99.78% <= 12 milliseconds
99.82% <= 13 milliseconds
99.84% <= 14 milliseconds
99.85% <= 15 milliseconds
99.85% <= 16 milliseconds
99.87% <= 17 milliseconds
99.89% <= 18 milliseconds
99.90% <= 19 milliseconds
99.90% <= 20 milliseconds
99.90% <= 21 milliseconds
99.92% <= 22 milliseconds
99.94% <= 23 milliseconds
99.95% <= 24 milliseconds
99.95% <= 30 milliseconds
99.97% <= 31 milliseconds
100.00% <= 31 milliseconds
12330.46 requests per second

====== RPOP ======
  100000 requests completed in 7.87 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.05% <= 1 milliseconds
4.37% <= 2 milliseconds
33.98% <= 3 milliseconds
77.71% <= 4 milliseconds
93.31% <= 5 milliseconds
96.39% <= 6 milliseconds
97.74% <= 7 milliseconds
98.55% <= 8 milliseconds
99.12% <= 9 milliseconds
99.44% <= 10 milliseconds
99.60% <= 11 milliseconds
99.69% <= 12 milliseconds
99.77% <= 13 milliseconds
99.80% <= 14 milliseconds
99.84% <= 15 milliseconds
99.87% <= 16 milliseconds
99.90% <= 17 milliseconds
99.90% <= 18 milliseconds
99.91% <= 19 milliseconds
99.93% <= 20 milliseconds
99.93% <= 21 milliseconds
99.93% <= 22 milliseconds
99.96% <= 23 milliseconds
99.97% <= 24 milliseconds
99.97% <= 25 milliseconds
99.99% <= 26 milliseconds
100.00% <= 27 milliseconds
100.00% <= 27 milliseconds
12712.94 requests per second

====== SADD ======
  100000 requests completed in 129.21 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 14 milliseconds
0.00% <= 16 milliseconds
0.00% <= 19 milliseconds
0.01% <= 20 milliseconds
0.01% <= 22 milliseconds
0.01% <= 24 milliseconds
0.01% <= 25 milliseconds
0.01% <= 28 milliseconds
0.01% <= 29 milliseconds
0.02% <= 30 milliseconds
0.02% <= 33 milliseconds
0.02% <= 34 milliseconds
0.02% <= 35 milliseconds
0.02% <= 36 milliseconds
0.03% <= 37 milliseconds
0.03% <= 38 milliseconds
0.03% <= 39 milliseconds
0.03% <= 40 milliseconds
0.03% <= 41 milliseconds
0.04% <= 43 milliseconds
0.04% <= 44 milliseconds
0.04% <= 45 milliseconds
0.04% <= 46 milliseconds
0.05% <= 47 milliseconds
0.05% <= 48 milliseconds
0.08% <= 49 milliseconds
0.22% <= 50 milliseconds
0.89% <= 51 milliseconds
3.05% <= 52 milliseconds
6.87% <= 53 milliseconds
11.99% <= 54 milliseconds
18.30% <= 55 milliseconds
24.76% <= 56 milliseconds
30.65% <= 57 milliseconds
36.15% <= 58 milliseconds
41.47% <= 59 milliseconds
46.52% <= 60 milliseconds
51.38% <= 61 milliseconds
55.52% <= 62 milliseconds
58.93% <= 63 milliseconds
62.24% <= 64 milliseconds
65.22% <= 65 milliseconds
67.87% <= 66 milliseconds
70.25% <= 67 milliseconds
72.46% <= 68 milliseconds
74.53% <= 69 milliseconds
76.57% <= 70 milliseconds
78.46% <= 71 milliseconds
80.21% <= 72 milliseconds
81.76% <= 73 milliseconds
83.09% <= 74 milliseconds
84.50% <= 75 milliseconds
85.82% <= 76 milliseconds
87.10% <= 77 milliseconds
88.27% <= 78 milliseconds
89.28% <= 79 milliseconds
90.21% <= 80 milliseconds
91.03% <= 81 milliseconds
91.79% <= 82 milliseconds
92.41% <= 83 milliseconds
92.93% <= 84 milliseconds
93.57% <= 85 milliseconds
94.12% <= 86 milliseconds
94.54% <= 87 milliseconds
94.95% <= 88 milliseconds
95.32% <= 89 milliseconds
95.73% <= 90 milliseconds
96.04% <= 91 milliseconds
96.36% <= 92 milliseconds
96.61% <= 93 milliseconds
96.87% <= 94 milliseconds
97.05% <= 95 milliseconds
97.24% <= 96 milliseconds
97.38% <= 97 milliseconds
97.50% <= 98 milliseconds
97.63% <= 99 milliseconds
97.78% <= 100 milliseconds
97.92% <= 101 milliseconds
98.01% <= 102 milliseconds
98.12% <= 103 milliseconds
98.21% <= 104 milliseconds
98.30% <= 105 milliseconds
98.40% <= 106 milliseconds
98.49% <= 107 milliseconds
98.57% <= 108 milliseconds
98.64% <= 109 milliseconds
98.70% <= 110 milliseconds
98.76% <= 111 milliseconds
98.82% <= 112 milliseconds
98.89% <= 113 milliseconds
98.94% <= 114 milliseconds
99.02% <= 115 milliseconds
99.09% <= 116 milliseconds
99.17% <= 117 milliseconds
99.25% <= 118 milliseconds
99.29% <= 119 milliseconds
99.33% <= 120 milliseconds
99.35% <= 121 milliseconds
99.37% <= 122 milliseconds
99.39% <= 123 milliseconds
99.40% <= 124 milliseconds
99.43% <= 125 milliseconds
99.45% <= 126 milliseconds
99.47% <= 127 milliseconds
99.49% <= 128 milliseconds
99.53% <= 129 milliseconds
99.55% <= 130 milliseconds
99.57% <= 131 milliseconds
99.59% <= 132 milliseconds
99.61% <= 133 milliseconds
99.63% <= 134 milliseconds
99.65% <= 135 milliseconds
99.66% <= 136 milliseconds
99.68% <= 137 milliseconds
99.70% <= 138 milliseconds
99.71% <= 139 milliseconds
99.73% <= 140 milliseconds
99.74% <= 141 milliseconds
99.75% <= 142 milliseconds
99.75% <= 143 milliseconds
99.76% <= 144 milliseconds
99.76% <= 145 milliseconds
99.77% <= 146 milliseconds
99.78% <= 147 milliseconds
99.78% <= 148 milliseconds
99.80% <= 149 milliseconds
99.81% <= 150 milliseconds
99.84% <= 151 milliseconds
99.86% <= 152 milliseconds
99.87% <= 153 milliseconds
99.88% <= 154 milliseconds
99.90% <= 155 milliseconds
99.92% <= 156 milliseconds
99.93% <= 157 milliseconds
99.94% <= 158 milliseconds
99.95% <= 159 milliseconds
99.96% <= 160 milliseconds
99.96% <= 161 milliseconds
99.96% <= 162 milliseconds
99.96% <= 165 milliseconds
99.96% <= 166 milliseconds
99.97% <= 167 milliseconds
99.97% <= 168 milliseconds
99.97% <= 169 milliseconds
99.97% <= 170 milliseconds
99.97% <= 171 milliseconds
99.98% <= 172 milliseconds
99.98% <= 173 milliseconds
99.98% <= 174 milliseconds
99.99% <= 175 milliseconds
99.99% <= 176 milliseconds
99.99% <= 177 milliseconds
99.99% <= 178 milliseconds
99.99% <= 179 milliseconds
99.99% <= 180 milliseconds
99.99% <= 183 milliseconds
99.99% <= 184 milliseconds
100.00% <= 187 milliseconds
100.00% <= 188 milliseconds
100.00% <= 189 milliseconds
100.00% <= 193 milliseconds
100.00% <= 195 milliseconds
773.93 requests per second

====== HSET ======
  100000 requests completed in 131.41 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 14 milliseconds
0.00% <= 16 milliseconds
0.00% <= 17 milliseconds
0.01% <= 18 milliseconds
0.01% <= 20 milliseconds
0.01% <= 22 milliseconds
0.01% <= 23 milliseconds
0.01% <= 24 milliseconds
0.01% <= 26 milliseconds
0.01% <= 27 milliseconds
0.01% <= 29 milliseconds
0.02% <= 30 milliseconds
0.02% <= 31 milliseconds
0.02% <= 33 milliseconds
0.02% <= 35 milliseconds
0.02% <= 36 milliseconds
0.02% <= 37 milliseconds
0.02% <= 38 milliseconds
0.03% <= 40 milliseconds
0.03% <= 42 milliseconds
0.03% <= 43 milliseconds
0.03% <= 44 milliseconds
0.03% <= 45 milliseconds
0.04% <= 46 milliseconds
0.04% <= 47 milliseconds
0.05% <= 48 milliseconds
0.06% <= 49 milliseconds
0.12% <= 50 milliseconds
0.36% <= 51 milliseconds
1.23% <= 52 milliseconds
3.30% <= 53 milliseconds
6.93% <= 54 milliseconds
12.45% <= 55 milliseconds
18.46% <= 56 milliseconds
24.91% <= 57 milliseconds
31.10% <= 58 milliseconds
36.71% <= 59 milliseconds
42.20% <= 60 milliseconds
47.46% <= 61 milliseconds
52.08% <= 62 milliseconds
56.00% <= 63 milliseconds
59.67% <= 64 milliseconds
62.94% <= 65 milliseconds
65.93% <= 66 milliseconds
68.54% <= 67 milliseconds
71.19% <= 68 milliseconds
73.71% <= 69 milliseconds
75.79% <= 70 milliseconds
77.54% <= 71 milliseconds
79.16% <= 72 milliseconds
80.78% <= 73 milliseconds
82.31% <= 74 milliseconds
83.72% <= 75 milliseconds
85.04% <= 76 milliseconds
86.19% <= 77 milliseconds
87.31% <= 78 milliseconds
88.26% <= 79 milliseconds
89.05% <= 80 milliseconds
89.82% <= 81 milliseconds
90.64% <= 82 milliseconds
91.39% <= 83 milliseconds
91.96% <= 84 milliseconds
92.49% <= 85 milliseconds
93.04% <= 86 milliseconds
93.57% <= 87 milliseconds
94.00% <= 88 milliseconds
94.42% <= 89 milliseconds
94.79% <= 90 milliseconds
95.20% <= 91 milliseconds
95.52% <= 92 milliseconds
95.82% <= 93 milliseconds
96.11% <= 94 milliseconds
96.36% <= 95 milliseconds
96.55% <= 96 milliseconds
96.80% <= 97 milliseconds
96.99% <= 98 milliseconds
97.19% <= 99 milliseconds
97.40% <= 100 milliseconds
97.56% <= 101 milliseconds
97.72% <= 102 milliseconds
97.82% <= 103 milliseconds
97.92% <= 104 milliseconds
98.02% <= 105 milliseconds
98.09% <= 106 milliseconds
98.16% <= 107 milliseconds
98.21% <= 108 milliseconds
98.27% <= 109 milliseconds
98.34% <= 110 milliseconds
98.39% <= 111 milliseconds
98.44% <= 112 milliseconds
98.48% <= 113 milliseconds
98.52% <= 114 milliseconds
98.57% <= 115 milliseconds
98.62% <= 116 milliseconds
98.65% <= 117 milliseconds
98.69% <= 118 milliseconds
98.72% <= 119 milliseconds
98.77% <= 120 milliseconds
98.83% <= 121 milliseconds
98.87% <= 122 milliseconds
98.92% <= 123 milliseconds
98.96% <= 124 milliseconds
99.00% <= 125 milliseconds
99.04% <= 126 milliseconds
99.08% <= 127 milliseconds
99.12% <= 128 milliseconds
99.16% <= 129 milliseconds
99.21% <= 130 milliseconds
99.26% <= 131 milliseconds
99.30% <= 132 milliseconds
99.35% <= 133 milliseconds
99.38% <= 134 milliseconds
99.41% <= 135 milliseconds
99.44% <= 136 milliseconds
99.45% <= 137 milliseconds
99.47% <= 138 milliseconds
99.51% <= 139 milliseconds
99.53% <= 140 milliseconds
99.56% <= 141 milliseconds
99.59% <= 142 milliseconds
99.61% <= 143 milliseconds
99.64% <= 144 milliseconds
99.65% <= 145 milliseconds
99.67% <= 146 milliseconds
99.68% <= 147 milliseconds
99.69% <= 148 milliseconds
99.71% <= 149 milliseconds
99.73% <= 150 milliseconds
99.75% <= 151 milliseconds
99.75% <= 152 milliseconds
99.76% <= 153 milliseconds
99.77% <= 154 milliseconds
99.79% <= 155 milliseconds
99.81% <= 156 milliseconds
99.82% <= 157 milliseconds
99.83% <= 158 milliseconds
99.84% <= 159 milliseconds
99.85% <= 160 milliseconds
99.85% <= 161 milliseconds
99.85% <= 162 milliseconds
99.86% <= 163 milliseconds
99.86% <= 164 milliseconds
99.87% <= 165 milliseconds
99.87% <= 166 milliseconds
99.87% <= 167 milliseconds
99.87% <= 168 milliseconds
99.87% <= 169 milliseconds
99.88% <= 170 milliseconds
99.88% <= 171 milliseconds
99.89% <= 172 milliseconds
99.89% <= 173 milliseconds
99.90% <= 174 milliseconds
99.90% <= 175 milliseconds
99.90% <= 176 milliseconds
99.91% <= 177 milliseconds
99.91% <= 178 milliseconds
99.91% <= 179 milliseconds
99.92% <= 180 milliseconds
99.92% <= 181 milliseconds
99.93% <= 182 milliseconds
99.93% <= 183 milliseconds
99.94% <= 184 milliseconds
99.95% <= 185 milliseconds
99.95% <= 186 milliseconds
99.95% <= 187 milliseconds
99.96% <= 188 milliseconds
99.96% <= 189 milliseconds
99.96% <= 190 milliseconds
99.97% <= 191 milliseconds
99.97% <= 192 milliseconds
99.98% <= 193 milliseconds
99.98% <= 194 milliseconds
99.98% <= 196 milliseconds
99.99% <= 197 milliseconds
99.99% <= 198 milliseconds
99.99% <= 199 milliseconds
99.99% <= 200 milliseconds
100.00% <= 200 milliseconds
760.97 requests per second

====== SPOP ======
  100000 requests completed in 8.28 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.05% <= 1 milliseconds
4.58% <= 2 milliseconds
32.50% <= 3 milliseconds
74.78% <= 4 milliseconds
90.34% <= 5 milliseconds
94.13% <= 6 milliseconds
96.08% <= 7 milliseconds
97.53% <= 8 milliseconds
98.39% <= 9 milliseconds
98.89% <= 10 milliseconds
99.18% <= 11 milliseconds
99.40% <= 12 milliseconds
99.47% <= 13 milliseconds
99.51% <= 14 milliseconds
99.63% <= 15 milliseconds
99.69% <= 16 milliseconds
99.73% <= 17 milliseconds
99.76% <= 18 milliseconds
99.82% <= 19 milliseconds
99.84% <= 20 milliseconds
99.87% <= 21 milliseconds
99.89% <= 22 milliseconds
99.93% <= 23 milliseconds
99.94% <= 24 milliseconds
99.95% <= 38 milliseconds
99.96% <= 39 milliseconds
99.97% <= 59 milliseconds
99.97% <= 60 milliseconds
99.98% <= 63 milliseconds
100.00% <= 63 milliseconds
12083.13 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 7.91 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.04% <= 1 milliseconds
5.11% <= 2 milliseconds
33.40% <= 3 milliseconds
76.37% <= 4 milliseconds
92.44% <= 5 milliseconds
96.01% <= 6 milliseconds
97.28% <= 7 milliseconds
98.15% <= 8 milliseconds
99.00% <= 9 milliseconds
99.41% <= 10 milliseconds
99.57% <= 11 milliseconds
99.66% <= 12 milliseconds
99.80% <= 13 milliseconds
99.84% <= 14 milliseconds
99.89% <= 15 milliseconds
99.91% <= 16 milliseconds
99.93% <= 17 milliseconds
99.94% <= 18 milliseconds
99.95% <= 27 milliseconds
99.97% <= 28 milliseconds
99.98% <= 29 milliseconds
99.98% <= 30 milliseconds
99.99% <= 31 milliseconds
99.99% <= 37 milliseconds
100.00% <= 38 milliseconds
12640.63 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 8.03 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.05% <= 1 milliseconds
4.70% <= 2 milliseconds
31.78% <= 3 milliseconds
73.89% <= 4 milliseconds
91.57% <= 5 milliseconds
95.86% <= 6 milliseconds
97.44% <= 7 milliseconds
98.29% <= 8 milliseconds
98.92% <= 9 milliseconds
99.33% <= 10 milliseconds
99.55% <= 11 milliseconds
99.70% <= 12 milliseconds
99.80% <= 13 milliseconds
99.89% <= 14 milliseconds
99.90% <= 15 milliseconds
99.90% <= 16 milliseconds
99.90% <= 18 milliseconds
99.90% <= 21 milliseconds
99.92% <= 22 milliseconds
99.93% <= 23 milliseconds
99.96% <= 24 milliseconds
99.97% <= 25 milliseconds
99.98% <= 28 milliseconds
99.98% <= 29 milliseconds
100.00% <= 30 milliseconds
12453.30 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 8.06 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.05% <= 1 milliseconds
4.76% <= 2 milliseconds
32.41% <= 3 milliseconds
74.94% <= 4 milliseconds
91.76% <= 5 milliseconds
95.47% <= 6 milliseconds
97.29% <= 7 milliseconds
98.37% <= 8 milliseconds
98.99% <= 9 milliseconds
99.30% <= 10 milliseconds
99.46% <= 11 milliseconds
99.56% <= 12 milliseconds
99.66% <= 13 milliseconds
99.74% <= 14 milliseconds
99.81% <= 15 milliseconds
99.85% <= 16 milliseconds
99.87% <= 17 milliseconds
99.90% <= 18 milliseconds
99.91% <= 19 milliseconds
99.92% <= 20 milliseconds
99.93% <= 21 milliseconds
99.93% <= 22 milliseconds
99.97% <= 23 milliseconds
100.00% <= 24 milliseconds
100.00% <= 27 milliseconds
12410.03 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 8.76 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.06% <= 1 milliseconds
3.87% <= 2 milliseconds
26.68% <= 3 milliseconds
66.77% <= 4 milliseconds
86.99% <= 5 milliseconds
93.38% <= 6 milliseconds
96.07% <= 7 milliseconds
97.48% <= 8 milliseconds
98.32% <= 9 milliseconds
98.80% <= 10 milliseconds
99.02% <= 11 milliseconds
99.18% <= 12 milliseconds
99.34% <= 13 milliseconds
99.49% <= 14 milliseconds
99.59% <= 15 milliseconds
99.67% <= 16 milliseconds
99.75% <= 17 milliseconds
99.82% <= 18 milliseconds
99.85% <= 19 milliseconds
99.85% <= 20 milliseconds
99.88% <= 21 milliseconds
99.90% <= 22 milliseconds
99.93% <= 23 milliseconds
99.93% <= 25 milliseconds
99.93% <= 29 milliseconds
99.95% <= 30 milliseconds
99.96% <= 31 milliseconds
99.99% <= 45 milliseconds
100.00% <= 46 milliseconds
100.00% <= 46 milliseconds
11419.44 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 8.51 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.06% <= 1 milliseconds
3.92% <= 2 milliseconds
29.21% <= 3 milliseconds
70.22% <= 4 milliseconds
88.71% <= 5 milliseconds
94.14% <= 6 milliseconds
96.20% <= 7 milliseconds
97.49% <= 8 milliseconds
98.41% <= 9 milliseconds
98.87% <= 10 milliseconds
99.18% <= 11 milliseconds
99.32% <= 12 milliseconds
99.47% <= 13 milliseconds
99.61% <= 14 milliseconds
99.68% <= 15 milliseconds
99.72% <= 16 milliseconds
99.78% <= 17 milliseconds
99.82% <= 18 milliseconds
99.84% <= 19 milliseconds
99.85% <= 20 milliseconds
99.89% <= 21 milliseconds
99.91% <= 23 milliseconds
99.92% <= 24 milliseconds
99.94% <= 25 milliseconds
99.94% <= 26 milliseconds
99.96% <= 27 milliseconds
99.97% <= 28 milliseconds
99.99% <= 29 milliseconds
100.00% <= 31 milliseconds
11755.03 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 9.01 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.03% <= 1 milliseconds
2.23% <= 2 milliseconds
20.40% <= 3 milliseconds
59.50% <= 4 milliseconds
84.19% <= 5 milliseconds
92.20% <= 6 milliseconds
95.32% <= 7 milliseconds
96.84% <= 8 milliseconds
97.93% <= 9 milliseconds
98.56% <= 10 milliseconds
99.01% <= 11 milliseconds
99.33% <= 12 milliseconds
99.49% <= 13 milliseconds
99.64% <= 14 milliseconds
99.78% <= 15 milliseconds
99.87% <= 16 milliseconds
99.92% <= 17 milliseconds
99.94% <= 18 milliseconds
99.94% <= 21 milliseconds
99.96% <= 22 milliseconds
99.98% <= 23 milliseconds
100.00% <= 24 milliseconds
11,095.09 requests per second